controllers/SgTestController.php

INSERT INTO `sg_test` (`Name`, `date`, `mod_date`) VALUES (10, '1970-25-11 12:25:59', '1970-25-11 13:25:59')
---
    public function actionCreate()
    {
        $model = new SgTest;

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `sg_test` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = SgTest::findOne($id)) !== null) {